#+AUTHOR:    Anton S. Kosinov
#+TITLE:     Mental Athlete ToDo List
#+SUBTITLE:  Life in a plain text
#+EMAIL:     a.s.kosinov@gmail.com
#+LANGUAGE: en
#+STARTUP: showall
#+PROPERTY:header-args :results output :exports both
# :session :cache yes :tangle yes :comments org 
#+CATEGORY: New Article
#+TODO: TODO | MAYBE DONE CLOSED

* [#A] Time Management
  :PROPERTIES:
  :CATEGORY: MetaKnowledge
  :LAST_REPEAT: [2018-03-07 Wed 12:39]
  :END:
  - State "DONE"       from "TODO"       [2018-03-07 Wed 12:39]
  :LOGBOOK:
  CLOCK: [2018-03-07 Wed 12:39]--[2018-03-07 Wed 12:39] =>  0:00
  :END:
  <2018-03-14 Wed ++1w>

** [#A] Daily Agenda Composing
   <2018-03-08 Thu ++1d>

** Agenda commands
   :PROPERTIES:
   :LAST_REPEAT: [2018-03-08 Thu 13:03]
   :END:
   - State "DONE"       from "TODO"       [2018-03-08 Thu 13:03]
   :LOGBOOK:
   CLOCK: [2018-03-08 Thu 12:58]--[2018-03-08 Thu 13:02] =>  0:04
   :END:
   [[info:org#Agenda%20commands][info:org#Agenda commands]]
   <2018-03-08 Thu ++1d>

** [#B] Regular events scheduling
   :LOGBOOK:
   CLOCK: [2018-03-08 Thu 13:05]--[2018-03-08 Thu 13:13] =>  0:08
   CLOCK: [2018-03-04 Sun 17:02]--[2018-03-04 Sun 17:23] =>  0:21
   :END:
   <2018-03-06 Tue ++1d> Hardcore time-schedule isn't a silver
   bullet and I'll follow for =Emacs= innate ~priority~ varying
   approach. We'll just exclde the =natural.org= with all
   bio-rthythms out from our Agenda by =C-x ]=


* [#C] Writing
  <%%(memq (calendar-day-of-week date) '(1 2 3 4 5))>


* NoSQL
* Emacs
* Python
